In [1]:
%pip install -q pandas==2.2.1

Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 24.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

In [3]:
pd.__version__

'2.2.1'

# Manipulando Dados em DataFrames do Pandas

In [4]:
# Criando um dicionário
dados = {'Estado': ['Santa Catarina', 'Rio de Janeiro', 'Tocantins', 'Bahia', 'Minas Gerais'],
         'Ano' : [2004, 2005, 2006, 2007, 2008],
         'Taxa Desemprego' : [1.5, 1.7, 1.6, 2.4, 2.7]}

In [5]:
from pandas import DataFrame

In [6]:
df = DataFrame(dados)

In [7]:
df.head()

           Estado   Ano  Taxa Desemprego
0  Santa Catarina  2004              1.5
1  Rio de Janeiro  2005              1.7
2       Tocantins  2006              1.6
3           Bahia  2007              2.4
4    Minas Gerais  2008              2.7

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
DataFrame(dados, columns = ['Estado', 'Taxa Desemprego', 'Ano'])

           Estado  Taxa Desemprego   Ano
0  Santa Catarina              1.5  2004
1  Rio de Janeiro              1.7  2005
2       Tocantins              1.6  2006
3           Bahia              2.4  2007
4    Minas Gerais              2.7  2008

In [10]:
df2 = DataFrame(dados, 
                columns = ['Estado', 'Taxa Desemprego', 'Taxa Crecimento', 'Ano'],
                index = ['estado1', 'estado2', 'estado3', 'estado4', 'estado5'])

In [11]:
df2

                 Estado  Taxa Desemprego Taxa Crecimento   Ano
estado1  Santa Catarina              1.5             NaN  2004
estado2  Rio de Janeiro              1.7             NaN  2005
estado3       Tocantins              1.6             NaN  2006
estado4           Bahia              2.4             NaN  2007
estado5    Minas Gerais              2.7             NaN  2008

In [12]:
df2.values

array([['Santa Catarina', 1.5, nan, 2004],
       ['Rio de Janeiro', 1.7, nan, 2005],
       ['Tocantins', 1.6, nan, 2006],
       ['Bahia', 2.4, nan, 2007],
       ['Minas Gerais', 2.7, nan, 2008]], dtype=object)

In [13]:
df2.dtypes

Estado              object
Taxa Desemprego    float64
Taxa Crecimento     object
Ano                  int64
dtype: object

In [14]:
df2.columns

Index(['Estado', 'Taxa Desemprego', 'Taxa Crecimento', 'Ano'], dtype='object')

In [15]:
df2['Estado']

estado1    Santa Catarina
estado2    Rio de Janeiro
estado3         Tocantins
estado4             Bahia
estado5      Minas Gerais
Name: Estado, dtype: object

In [16]:
df2[['Taxa Desemprego', 'Ano']]

         Taxa Desemprego   Ano
estado1              1.5  2004
estado2              1.7  2005
estado3              1.6  2006
estado4              2.4  2007
estado5              2.7  2008

In [17]:
df2.index

Index(['estado1', 'estado2', 'estado3', 'estado4', 'estado5'], dtype='object')

In [18]:
df2.filter(items = ['estado3'], axis = 0)

            Estado  Taxa Desemprego Taxa Crecimento   Ano
estado3  Tocantins              1.6             NaN  2006

Usando NumPy e Pandas para minupulação de dados

In [19]:
df2.head()

                 Estado  Taxa Desemprego Taxa Crecimento   Ano
estado1  Santa Catarina              1.5             NaN  2004
estado2  Rio de Janeiro              1.7             NaN  2005
estado3       Tocantins              1.6             NaN  2006
estado4           Bahia              2.4             NaN  2007
estado5    Minas Gerais              2.7             NaN  2008

In [20]:
df2.dtypes

Estado              object
Taxa Desemprego    float64
Taxa Crecimento     object
Ano                  int64
dtype: object

In [21]:
df2.describe()

       Taxa Desemprego          Ano
count         5.000000     5.000000
mean          1.980000  2006.000000
std           0.535724     1.581139
min           1.500000  2004.000000
25%           1.600000  2005.000000
50%           1.700000  2006.000000
75%           2.400000  2007.000000
max           2.700000  2008.000000

In [22]:
df2.isna()

         Estado  Taxa Desemprego  Taxa Crecimento    Ano
estado1   False            False             True  False
estado2   False            False             True  False
estado3   False            False             True  False
estado4   False            False             True  False
estado5   False            False             True  False

In [23]:
df2['Taxa Crecimento'].isna()

estado1    True
estado2    True
estado3    True
estado4    True
estado5    True
Name: Taxa Crecimento, dtype: bool

In [24]:
import numpy as np

In [25]:
df2["Taxa Crecimento"] = np.arange(5.)

In [26]:
df2

                 Estado  Taxa Desemprego  Taxa Crecimento   Ano
estado1  Santa Catarina              1.5              0.0  2004
estado2  Rio de Janeiro              1.7              1.0  2005
estado3       Tocantins              1.6              2.0  2006
estado4           Bahia              2.4              3.0  2007
estado5    Minas Gerais              2.7              4.0  2008

In [27]:
df2.dtypes

Estado              object
Taxa Desemprego    float64
Taxa Crecimento    float64
Ano                  int64
dtype: object

In [28]:
df2["Taxa Crecimento"].isna()

estado1    False
estado2    False
estado3    False
estado4    False
estado5    False
Name: Taxa Crecimento, dtype: bool

In [29]:
df2.describe()

       Taxa Desemprego  Taxa Crecimento          Ano
count         5.000000         5.000000     5.000000
mean          1.980000         2.000000  2006.000000
std           0.535724         1.581139     1.581139
min           1.500000         0.000000  2004.000000
25%           1.600000         1.000000  2005.000000
50%           1.700000         2.000000  2006.000000
75%           2.400000         3.000000  2007.000000
max           2.700000         4.000000  2008.000000

Slicing de DataFrames do Pandas

In [30]:
df2

                 Estado  Taxa Desemprego  Taxa Crecimento   Ano
estado1  Santa Catarina              1.5              0.0  2004
estado2  Rio de Janeiro              1.7              1.0  2005
estado3       Tocantins              1.6              2.0  2006
estado4           Bahia              2.4              3.0  2007
estado5    Minas Gerais              2.7              4.0  2008

In [31]:
df2['estado2' : 'estado4']

                 Estado  Taxa Desemprego  Taxa Crecimento   Ano
estado2  Rio de Janeiro              1.7              1.0  2005
estado3       Tocantins              1.6              2.0  2006
estado4           Bahia              2.4              3.0  2007

In [32]:
df2[df2['Taxa Desemprego'] < 2]

                 Estado  Taxa Desemprego  Taxa Crecimento   Ano
estado1  Santa Catarina              1.5              0.0  2004
estado2  Rio de Janeiro              1.7              1.0  2005
estado3       Tocantins              1.6              2.0  2006

In [33]:
df2[['Estado', 'Taxa Crecimento']]

                 Estado  Taxa Crecimento
estado1  Santa Catarina              0.0
estado2  Rio de Janeiro              1.0
estado3       Tocantins              2.0
estado4           Bahia              3.0
estado5    Minas Gerais              4.0

In [34]:
df2[['Estado', 'Taxa Crecimento', 'Ano']]

                 Estado  Taxa Crecimento   Ano
estado1  Santa Catarina              0.0  2004
estado2  Rio de Janeiro              1.0  2005
estado3       Tocantins              2.0  2006
estado4           Bahia              3.0  2007
estado5    Minas Gerais              4.0  2008

Preenchedo Valores Ausentes em DataFrame do Pandas

In [35]:
dsa_df = pd.read_csv("dataset.csv")

In [40]:
dsa_df.head(15)

,ID_Pedido,Data_Pedido,ID_Cliente,Segmento,Pais,Regiao,ID_Produto,Categoria,Nome_Produto,Valor_Venda,Quantidade
0,CA-2016-152156,2016-11-08,CG-12520,Consumer,United States,South,FUR-BO-10001798,Furniture,Bush Somerset Collection Bookcase,261.9600,NaN
1,CA-2016-152156,2016-11-08,CG-12520,Consumer,United States,South,FUR-CH-10000454,Furniture,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,NaN
2,CA-2016-138688,2016-06-12,DV-13045,Corporate,United States,West,OFF-LA-10000240,Office Supplies,Self-Adhesive Address Labels for Typewriters b...,14.6200,2.0
3,US-2015-108966,2015-10-11,SO-20335,Consumer,United States,South,FUR-TA-10000577,Furniture,Bretford CR4500 Series Slim Rectangular Table,957.5775,5.0
4,US-2015-108966,2015-10-11,SO-20335,Consumer,United States,South,OFF-ST-10000760,Office Supplies,Eldon Fold 'N Roll Cart System,22.3680,2.0
5,CA-2014-115812,2014-06-09,BH-11710,Consumer,United States,West,FUR-FU-10001487,Furniture,Eldon Expressions Wood and Plastic Desk Access...,48.8600,7.0
6,CA-2014-115812,2014-06-09,BH-11710,Consumer,United States,West,OFF-AR-10002833,Office Supplies,Newell 322,7.2800,4.0
7,CA-2014-115812,2014-06-09,BH-11710,Consumer,United States,West,TEC-PH-10002275,Technology,Mitel 5320 IP Phone VoIP phone,907.1520,6.0
8,CA-2014-115812,2014-06-09,BH-11710,Consumer,United States,West,OFF-BI-10003910,Office Supplies,DXL Angle-View Binders with Locking Rings by S...,18.5040,3.0
9,CA-2014-115812,2014-06-09,BH-11710,Consumer,United States,West,OFF-AP-10002892,Office Supplies,Belkin F5C206VTEL 6 Outlet Surge,114.9000,5.0
10,CA-2014-115812,2014-06-09,BH-11710,Consumer,United States,West,FUR-TA-10001539,Furniture,Chromcraft Rectangular Conference Tables,1706.1840,9.0
11,CA-2014-115812,2014-06-09,BH-11710,Consumer,United States,West,TEC-PH-10002033,Technology,Konftel 250 Conference phone - Charcoal black,911.4240,4.0
12,CA-2017-114412,2017-04-15,AA-10480,Consumer,United States,South,OFF-PA-10002365,Office Supplies,Xerox 1967,15.5520,3.0
13,CA-2016-161389,2016-12-05,IM-15070,Consumer,United States,West,OFF-BI-10003656,Office Supplies,Fellowes PB200 Plastic Comb Binding Machine,407.9760,3.0
14,US-2015-118983,2015-11-22,HP-14815,Home Office,United States,Central,OFF-AP-10002311,Office Supplies,Holmes Replacement Filter for HEPA Air Cleaner...,68.8100,5.0

In [37]:
dsa_df.isna().sum()

ID_Pedido       0
Data_Pedido     0
ID_Cliente      0
Segmento        0
Pais            0
Regiao          0
ID_Produto      0
Categoria       0
Nome_Produto    0
Valor_Venda     0
Quantidade      2
dtype: int64

In [38]:
moda = dsa_df['Quantidade'].value_counts().index[0]

In [39]:
print(moda)

3.0

In [41]:
dsa_df['Quantidade'].fillna(value=moda, inplace=True)

C:\Users\vitor\AppData\Local\Temp\ipykernel_21512\1298996890.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dsa_df['Quantidade'].fillna(value=moda, inplace=True)

In [42]:
dsa_df.isna().sum()

ID_Pedido       0
Data_Pedido     0
ID_Cliente      0
Segmento        0
Pais            0
Regiao          0
ID_Produto      0
Categoria       0
Nome_Produto    0
Valor_Venda     0
Quantidade      0
dtype: int64

Query (Consulta) de Dados no DataFrame do Pandas

In [44]:
dsa_df.head()

,ID_Pedido,Data_Pedido,ID_Cliente,Segmento,Pais,Regiao,ID_Produto,Categoria,Nome_Produto,Valor_Venda,Quantidade
0,CA-2016-152156,2016-11-08,CG-12520,Consumer,United States,South,FUR-BO-10001798,Furniture,Bush Somerset Collection Bookcase,261.9600,3.0
1,CA-2016-152156,2016-11-08,CG-12520,Consumer,United States,South,FUR-CH-10000454,Furniture,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3.0
2,CA-2016-138688,2016-06-12,DV-13045,Corporate,United States,West,OFF-LA-10000240,Office Supplies,Self-Adhesive Address Labels for Typewriters b...,14.6200,2.0
3,US-2015-108966,2015-10-11,SO-20335,Consumer,United States,South,FUR-TA-10000577,Furniture,Bretford CR4500 Series Slim Rectangular Table,957.5775,5.0
4,US-2015-108966,2015-10-11,SO-20335,Consumer,United States,South,OFF-ST-10000760,Office Supplies,Eldon Fold 'N Roll Cart System,22.3680,2.0

In [43]:
dsa_df.Valor_Venda.describe()

count     9994.000000
mean       229.858001
std        623.245101
min          0.444000
25%         17.280000
50%         54.490000
75%        209.940000
max      22638.480000
Name: Valor_Venda, dtype: float64

In [45]:
df2 = dsa_df.query('229 < Valor_Venda < 10000')

In [46]:
df2.Valor_Venda.describe()

count    2357.000000
mean      766.679142
std       856.315136
min       229.544000
25%       323.100000
50%       490.320000
75%       859.200000
max      9892.740000
Name: Valor_Venda, dtype: float64

In [47]:
df3 = df2.query('Valor_Venda > 766')

In [48]:
df3.head()

,ID_Pedido,Data_Pedido,ID_Cliente,Segmento,Pais,Regiao,ID_Produto,Categoria,Nome_Produto,Valor_Venda,Quantidade
3,US-2015-108966,2015-10-11,SO-20335,Consumer,United States,South,FUR-TA-10000577,Furniture,Bretford CR4500 Series Slim Rectangular Table,957.5775,5.0
7,CA-2014-115812,2014-06-09,BH-11710,Consumer,United States,West,TEC-PH-10002275,Technology,Mitel 5320 IP Phone VoIP phone,907.1520,6.0
10,CA-2014-115812,2014-06-09,BH-11710,Consumer,United States,West,FUR-TA-10001539,Furniture,Chromcraft Rectangular Conference Tables,1706.1840,9.0
11,CA-2014-115812,2014-06-09,BH-11710,Consumer,United States,West,TEC-PH-10002033,Technology,Konftel 250 Conference phone - Charcoal black,911.4240,4.0
24,CA-2015-106320,2015-09-25,EB-13870,Consumer,United States,West,FUR-TA-10000577,Furniture,Bretford CR4500 Series Slim Rectangular Table,1044.6300,3.0